import ButovkaTitle from "./../assets/container-title-5.85х2.4.jpg";
import ContainerOne1 from "./../assets/container-5.85х2.4-1.jpg";
import ContainerOne2 from "./../assets/container-5.85х2.4-2.jpeg";
import ContainerOne3 from "./../assets/container-5.85х2.4-3.jpg";
import ContainerOne4 from "./../assets/container-5.85х2.4-4.jpg";
import ContainerTwo1 from "./../assets/container-5х2.4-1.jpg";
import ContainerTwo2 from "./../assets/container-5х2.4-2.jpg";
import ContainerTwo3 from "./../assets/container-5х2.4-3.jpg";
import ContainerThree1 from "./../assets/container-vrem-1.jpg";
import ContainerThree2 from "./../assets/container-vrem-2.jpeg";
import ContainerThree3 from "./../assets/container-vrem-3.jpg";
import ToiletOne1 from "./../assets//toilet-1.2х1.4-1.jpg";
import ToiletOne2 from "./../assets/toilet-1-1.2х1.4-2.jpg";
import ToiletOne3 from "./../assets/toilet-1.2х1.4-3.jpg";
import ToiletOne4 from "./../assets/toilet-1-1.2х1.4-4.jpg";
import ToiletOne5 from "./../assets/toilet-1-1.2х1.4-5.jpg";
import ToiletTwo1 from "./../assets/toilet-house-1.jpg";
import ToiletTwo2 from "./../assets/toilet-house-2.jpg";
import ToiletTwo3 from "./../assets/toilet-house-3.jpg";
import ToiletTwo4 from "./../assets/toilet-house-4.jpg";
import ToiletThree1 from "./../assets/toilet-standart-1.jpg";
import ToiletThree2 from "./../assets/toilet-standart-2.jpg";
import ToiletThree3 from "./../assets/toilet-standart-3.jpg";
import ToiletFour1 from "./../assets/toilet-triangle-1.jpg";
import ToiletFour2 from "./../assets/toilet-triangle-2.jpg";
import ToiletFour3 from "./../assets/toilet-triangle-3.jpg";
import ToiletFive1 from "./../assets/toilet-shower-1.jpg";
import ToiletFive2 from "./../assets/toilet-shower-2.jpg";
import ButovkaOneTitle from "./../assets/butobkaOne-title.jpg";
import ButovkaOne1 from "./../assets/butobkaOne-2.jpg";
import ButovkaOne2 from "./../assets/butobkaOne-1.jpg";
import ButovkaOne3 from "./../assets/butobkaOne-3.jpeg";
import ButovkaDrovnik1 from "./../assets/butovkaDrovnik-1.jpg";
import ButovkaDrovnik2 from "./../assets/butovkaDrovnik-2.jpg";
import ButovkaDrovnik3 from "./../assets/butovkaDrovnik-3.jpg";
import ButovkaDrovnik4 from "./../assets/butovkaDrovnik-4.jpeg";
import ButovkaTwo1 from "./../assets/ButovkaTwo-1.jpg";
import ButovkaTwo2 from "./../assets/ButovkaTwo-2.jpeg";
import ButovkaTwo3 from "./../assets/ButovkaTwo-3.jpg";
import ButovkaTwo4 from "./../assets/ButovkaTwo-4.jpg";
import ButovkaStandart1 from "./../assets/ButovkaStandartTitle.jpg";
import ButovkaStandart2 from "./../assets/ButovkaStandart-1.jpeg";
import ButovkaStandart3 from "./../assets/ButovkaStandart-2.jpg";
import ButovkaStandart4 from "./../assets/ButovkaStandart-3.jpg";
import ButovkaImitation1 from "./../assets/butovkaTitleImitation.jpg";
import ButovkaImitation2 from "./../assets/butovkaImitation-1.jpeg";
import ButovkaImitation3 from "./../assets/butovkaImitation-2.jpg";
import ButovkaImitation4 from "./../assets/butovkaImitation-3.jpg";

import { TItem } from "./types";

export const items = [
  { title: "Деревянные бытовки", slug: "butovki", img: ButovkaOneTitle },
  // { title: "Модульные строения", slug: 'modal-buildings', img: Img },
  { title: "Блок-контейнеры", slug: "containers", img: ButovkaTitle },
  // { title: "Летние домики", slug: 'summer-houses', img: Img },
  { title: "Туалеты", slug: "bathrooms", img: ToiletOne1 },
  // { title: "Вольеры", slug: 'volers', img: Img },
  // { title: "Каркасные дома", slug: 'karkas-buildings', img: Img },
];

export const butovki: TItem[] = [
  {
    title: "Бытовка 3х2.3 (по крыше)",
    text: "Стандартная комплектация. (Модификации уточняйте у менеджера)",
    img: [ButovkaOneTitle, ButovkaOne1, ButovkaOne2, ButovkaOne3],
    specs: [
      "Каркас(основание): 50х50 брус (естественная влажность)",
      "Утепление: 50 мм (минеральная вата) пол, стены, потолок",
      "Пароизоляция + ветрозащита (внутри): пол, стены, потолок",
      "Кровля: профлист оцинкованный С8 0.4 мм",
      "Тип крыши: односкатная ",
      "Внешняя отделка: Вагонка С (есть выпавшие сучки - запениваются) Камерная сушка. Зашивается ёлочкой.",
      "Внутренняя отделка (стены, потолок): Нет/ДВП/Вагонка/Имитация бруса/ОСП/ПВХ",
      "Лыжи: Брус 100х100 мм",
      "Пол черновой: обрешетка 25х150 мм 2 сорт (естественная влажность)",
      "Пол чистовой: обрешетка 25х150 мм 2 сорт (естественная влажность) + лист ОСП 9 мм",
      "Окно: Деревянное 70х80 - 1 шт. (распашное) двойного остекления.",
      "Двери входные: наборная на каркасе 80х190 (деревянная) 1 шт. Утепленная.",
      "Высота потолка 200 см.",
    ],
    price: "Цена от 63 000 рублей",
    guarantee: "На бытовки предоставляется гарантия 6 месяцев.",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель) не подключается",
    ],
  },
  {
    title: "Бытовка 5х2.3 (по крыше)",
    text: "Стандартная комплектация. (Модификации уточняйте у менеджера)",
    img: [ButovkaDrovnik1, ButovkaDrovnik2, ButovkaDrovnik3, ButovkaDrovnik4],
    specs: [
      "Каркас(основание): 50х50 брус (естественная влажность)",
      "Утепление: 50 мм (минеральная вата) пол, стены, потолок",
      "Пароизоляция + ветрозащита (внутри): пол, стены, потолок",
      "Кровля: профлист оцинкованный С8 0.4 мм",
      "Тип крыши: односкатная ",
      "Внешняя отделка: Вагонка С (есть выпавшие сучки - запениваются) Камерная сушка. Зашивается ёлочкой.",
      "Внутренняя отделка (стены, потолок): Нет/ДВП/Вагонка/Имитация бруса/ОСП/ПВХ",
      "Лыжи: Брус 100х100 мм",
      "Пол черновой: обрешетка 25х150 мм 2 сорт (естественная влажность)",
      "Пол чистовой: обрешетка 25х150 мм 2 сорт (естественная влажность) + лист ОСП 9 мм",
      "Окно: Деревянное 70х80 - 1 шт. (распашное) двойного остекления.",
      "Двери входные: наборная на каркасе 80х190 (деревянная) 1 шт. Утепленная.",
      "Высота потолка 200 см.",
      "Дровник",
    ],
    price: "Цена от 80 000 рублей",
    guarantee: "На бытовки предоставляется гарантия 6 месяцев.",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель) не подключается",
    ],
  },
  {
    title: "Бытовка 6х2.3 (по крыше)",
    text: "Стандартная комплектация. (Модификации уточняйте у менеджера)",
    img: [ButovkaTwo1, ButovkaTwo2, ButovkaTwo3, ButovkaTwo4],
    specs: [
      "Каркас(основание): 50х50 брус (естественная влажность)",
      "Утепление: 50 мм (минеральная вата) пол, стены, потолок",
      "Пароизоляция + ветрозащита (внутри): пол, стены, потолок",
      "Кровля: профлист оцинкованный С8 0.4 мм",
      "Тип крыши: двускатная ",
      "Внешняя отделка: Вагонка С (есть выпавшие сучки - запениваются) Камерная сушка. Зашивается ёлочкой.",
      "Внутренняя отделка (стены, потолок): Нет/ДВП/Вагонка/Имитация бруса/ОСП/ПВХ",
      "Лыжи: Брус 100х100 мм",
      "Пол черновой: обрешетка 25х150 мм 2 сорт (естественная влажность)",
      "Пол чистовой: обрешетка 25х150 мм 2 сорт (естественная влажность) + лист ОСП 9 мм",
      "Окно: ПВХ 50х120 - 1 шт. ",
      "Двери входные: Металлическая 87х210 - 1 шт. Утепленная, с врезным замком.",
      "Высота потолка 250 см.",
    ],
    price: "Цена от 145 000 рублей",
    guarantee: "На бытовки предоставляется гарантия 6 месяцев.",
    gift: [],
  },
  {
    title: "Бытовка 6х2.3 (по крыше)",
    text: "Стандартная комплектация. (Модификации уточняйте у менеджера)",
    img: [
      ButovkaStandart1,
      ButovkaStandart2,
      ButovkaStandart3,
      ButovkaStandart4,
    ],
    specs: [
      "Каркас(основание): 50х50 брус (естественная влажность)",
      "Утепление: 50 мм (минеральная вата) пол, стены, потолок",
      "Пароизоляция + ветрозащита (внутри): пол, стены, потолок",
      "Кровля: профлист оцинкованный С8 0.4 мм",
      "Тип крыши: односкатная",
      "Внешняя отделка: Вагонка С (есть выпавшие сучки - запениваются) Камерная сушка. Зашивается ёлочкой.",
      "Внутренняя отделка (стены, потолок): Нет/ДВП/Вагонка/Имитация бруса/ОСП/ПВХ",
      "Лыжи: Брус 100х100 мм",
      "Пол черновой: обрешетка 25х150 мм 2 сорт (естественная влажность)",
      "Пол чистовой: обрешетка 25х150 мм 2 сорт (естественная влажность) + лист ОСП 9 мм",
      "Окно: Деревянное 70х80 - 2 шт. (распашное) двойного остекления.",
      "Двери входные: наборная на каркасе 80х190 (деревянная) 1 шт. Утепленная. ",
      "Высота потолка 200 см.",
    ],
    price: "Цена от 77 000 рублей",
    guarantee: "На бытовки предоставляется гарантия 6 месяцев.",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель) не подключается",
    ],
  },
  {
    title: "Бытовка 6х2.3 (по крыше)",
    text: "Стандартная комплектация. (Модификации уточняйте у менеджера)",
    img: [
      ButovkaImitation1,
      ButovkaImitation2,
      ButovkaImitation3,
      ButovkaImitation4,
    ],
    specs: [
      "Каркас(основание): 50х50 брус (естественная влажность)",
      "Утепление: 50 мм (минеральная вата) пол, стены, потолок",
      "Пароизоляция + ветрозащита (внутри): пол, стены, потолок",
      "Кровля: профлист оцинкованный С8 0.4 мм",
      "Тип крыши: односкатная",
      "Внешняя отделка: Имитация бруса С (есть выпавшие сучки - запениваются) Камерная сушка.",
      "Внутренняя отделка (стены, потолок): Нет/ДВП/Вагонка/Имитация бруса/ОСП/ПВХ",
      "Лыжи: Брус 100х100 мм",
      "Пол черновой: обрешетка 25х150 мм 2 сорт (естественная влажность)",
      "Пол чистовой: обрешетка 25х150 мм 2 сорт (естественная влажность) + лист ОСП 9 мм",
      "Окно: Нет",
      "Двери входные: наборная на каркасе 80х190 (деревянная) 1 шт. Утепленная.",
      "Высота потолка 200 см.",
    ],
    price: "Цена от 83 000 рублей",
    guarantee: "На бытовки предоставляется гарантия 6 месяцев.",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель) не подключается",
    ],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
  {
    title: "Блабла",
    text: "Блок-контейнеры",
    img: [],
    specs: [],
    price: "",
    guarantee: "Н",
    gift: [],
  },
];

export const modal = [
  { title: "Блабла", text: "Деревянные бытовки", img: [] },
  { title: "Блабла", text: "Модульные строения", img: [] },
  { title: "Блабла", text: "Блок контейнеры", img: [] },
];

export const containers: TItem[] = [
  {
    title: "БЛОК КОНТЕЙНЕР 5.85х2.4",
    text: "Стандартная комплектация. (Модификации уточняйте у менеджера)",
    img: [
      ButovkaTitle,
      ContainerOne1,
      ContainerOne2,
      ContainerOne3,
      ContainerOne4,
    ],
    specs: [
      "Каркас: Швеллер 100х50х3 мм + уголок 63х63 мм",
      "Утепление (стены, потолок, пол): минеральная вата 50 мм",
      "Пароизоляция + ветрозащита (стены, пол, потолок)",
      "Кровля: лист металла оцинкованный 0.7 мм",
      "Внешняя отделка (стены): Имитация бруса АБ. Камерная сушка",
      "Внутренняя отделка (стены, потолок): Нет/ДВП/Вагонка/Имитация бруса/ОСП/ПВХ",
      "Пол черновой: обрешетка 25х150 2 сорт, ель",
      "Пол чистовой: доска 25х150 2 сорт, ель + ОСП 9 мм",
      "Окно: ПВХ 60х90 — 2 шт.",
      "Дверь входная: установка двери заказчика",
      "Высота потолка: 240 см. Прямой",
    ],
    price: "от 175 000 ₽",
    guarantee: "На блок-контейнеры предоставляется гарантия 6 месяцев.",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель — не подключается)",
    ],
  },
  {
    title:
      "Блок-контейнер 5х2.4, Стандартная комплектация. (Модификации уточняйте у менеджера)",
    text: "Блок-контейнер отлично подойдет под офис. Имеются петли для перевози. Каркас усилен боковыми ребрами жесткости. В комплекте базовая офисная электрика.",
    img: [ContainerTwo1, ContainerTwo2, ContainerTwo3],
    specs: [
      "Каркас: Швеллер 100х50х3 мм + уголок 63х63 мм (усилен дополнительными ребами жесткости)",
      "Утепление (стены, потолок, пол): базальтовая плита 50 мм",
      "Пароизоляция + ветрозащита (стены, пол, потолок)",
      "Кровля: лист металла оцинкованный 0.7 мм (обработан гидроизолом)",
      "Внешняя отделка (стены): Профлист цветной RAL 7024 0.4 мм",
      "Внутренняя отделка (стены, потолок): ОСП 9 мм (швы зашиты рейками)",
      "Пол черновой: обрешетка 25х150 2 сорт, ель",
      "Пол чистовой: доска 25х150 2 сорт, ель + ОСП 9 мм + линолеум",
      "Окно: ПВХ 180х180 - 1 шт. (двойной стеклопакет)",
      "Дверь входная: Металлическая 87х210 - 1 шт. Утеплена, с врезным замком.",
      "Высота потолка 220 см. Прямой.",
      "Электрика: коробка + автомат + лампы (2 шт).",
    ],
    price: "от 190 000 ₽",
    guarantee: "На блок-контейнеры предоставляется гарантия 6 месяцев.",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель) не подключается",
    ],
  },
  {
    title: "Врем",
    text: "блабалалал>",
    img: [ContainerThree1, ContainerThree2, ContainerThree3],
  },
];

export const summer = [
  { title: "Блабла", text: "Бытовка", img: [] },
  { title: "Блабла", text: "Модульные строения", img: [] },
  { title: "Блабла", text: "Блок контейнеры", img: [] },
];

export const bathrooms: TItem[] = [
  {
    title: "1.2х1.4",
    text: "1.2х1.4",
    img: [ToiletOne1, ToiletOne2, ToiletOne3, ToiletOne4, ToiletOne5],
    specs: [
      "Каркас (основание): 50х50 брус (естественная влажность)",
      "Утепление: нет",
      "Пароизоляция (внутри): пол, стены, потолок",
      "Кровля: профлист оцинкованный С8 0.4 мм",
      "Тип крыши: двускатная",
      "Внешняя отделка: Имитация бруса С (с сучками, камерная сушка)",
      "Внутренняя отделка (стены, потолок): Вагонка С (с сучками, камерная сушка)",
      "Лыжи: брус 100х100 мм",
      "Пол черновой: обрешетка 25х150 мм 2 сорт",
      "Пол чистовой: обрешетка 25х150 мм 2 сорт + ОСБ 9 мм",
      "Окно: деревянное 40х40 см (распашное), двойное остекление",
      "Двери входные: наборная на каркасе 80х190 (деревянная), не утеплённая",
      "Высота потолка: 200 см",
      "Пьедестал: да",
    ],
    price: "30 000 ₽",
    guarantee: "Гарантия 6 месяцев",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель — не подключается)",
    ],
  },
  {
    title: "1х1 домиком",
    text: "1х1 домиком",
    img: [ToiletTwo1, ToiletTwo2, ToiletTwo3, ToiletTwo4],
    specs: [
      "Каркас (основание): 50х50 брус (естественная влажность)",
      "Утепление: нет (можно добавить)",
      "Пароизоляция: нет (можно добавить)",
      "Кровля: цветной профлист С8 (RAL по выбору)",
      "Тип крыши: двускатная",
      "Внешняя отделка: Вагонка С (с сучками, камерная сушка)",
      "Внутренняя отделка: нет (можно добавить)",
      "Лыжи: брус 100х100 мм",
      "Пол чистовой: доска 25х150 мм + ОСБ 9 мм",
      "Окно: нет (можно добавить)",
      "Двери входные: наборная на каркасе 80х190 (деревянная), не утеплённая",
      "Высота потолка: 200 см",
      "Пьедестал: да",
    ],
    price: "20 000 ₽",
    guarantee: "Гарантия 6 месяцев",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель — не подключается)",
    ],
  },
  {
    title: "1х1 Стандарт",
    text: "1х1 Стандарт",
    img: [ToiletThree1, ToiletThree2, ToiletThree3],
    specs: [
      "Каркас (основание): 50х50 брус (естественная влажность)",
      "Утепление: нет (можно добавить)",
      "Пароизоляция: нет (можно добавить)",
      "Кровля: оцинкованный профлист С8 0.4 мм",
      "Тип крыши: односкатная",
      "Внешняя отделка: Вагонка С (с сучками, камерная сушка)",
      "Внутренняя отделка: нет (можно добавить)",
      "Лыжи: брус 100х100 мм",
      "Пол чистовой: доска 25х150 мм + ОСБ 9 мм",
      "Окно: нет (можно добавить)",
      "Двери входные: наборная на каркасе 80х190 (деревянная), не утеплённая",
      "Высота потолка: 200 см",
      "Пьедестал: да",
    ],
    price: "15 000 ₽",
    guarantee: "Гарантия 6 месяцев",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель — не подключается)",
    ],
  },
  {
    title: "1х1 пирамидой",
    text: "1х1 пирамидой",
    img: [ToiletFour1, ToiletFour2, ToiletFour3],
    specs: [
      "Каркас (основание): 50х50 брус (естественная влажность)",
      "Утепление: нет (можно добавить)",
      "Пароизоляция: нет (можно добавить)",
      "Кровля: оцинкованный профлист С8 0.4 мм",
      "Тип крыши: односкатная",
      "Внешняя отделка: Вагонка С (с сучками, камерная сушка)",
      "Внутренняя отделка: нет (можно добавить)",
      "Лыжи: брус 100х100 мм",
      "Пол чистовой: доска 25х150 мм + ОСБ 9 мм",
      "Окно: нет (можно добавить)",
      "Двери входные: наборная на каркасе 80х190 (деревянная), не утеплённая",
      "Высота потолка: 200 см",
      "Пьедестал: да",
    ],
    price: "22 000 ₽",
    guarantee: "Гарантия 6 месяцев",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель — не подключается)",
    ],
  },
  {
    title: "2х1. Туалет-Душ",
    text: "2х1. Туалет-Душ",
    img: [ToiletFive1, ToiletFive2],
    specs: [
      "Каркас (основание): 50х50 брус (естественная влажность)",
      "Утепление: нет (можно добавить)",
      "Пароизоляция: нет (можно добавить)",
      "Кровля: оцинкованный профлист С8 0.4 мм",
      "Тип крыши: односкатная",
      "Внешняя отделка: Вагонка С (с сучками, камерная сушка)",
      "Внутренняя отделка: нет (можно добавить)",
      "Лыжи: брус 100х100 мм",
      "Пол чистовой: доска 25х150 мм + ОСБ 9 мм",
      "Окно: нет (можно добавить)",
      "Двери входные: наборная на каркасе 80х190 (деревянная), не утеплённая",
      "Высота потолка: 200 см",
      "Пьедестал: да",
    ],
    price: "25 000 ₽",
    guarantee: "Гарантия 6 месяцев",
    gift: [
      "Ступени для входа",
      "Фундаментные блоки 20х20х40",
      "Базовая электрика (1 патрон, 1 розетка, выключатель — не подключается)",
    ],
  },
];

export const volers = [
  { title: "Блабла", text: "Бытовка", img: [] },
  { title: "Блабла", text: "Модульные строения", img: [] },
  { title: "Блабла", text: "Блок контейнеры", img: [] },
];

export const karkas = [
  { title: "Блабла", text: "Бытовка", img: [] },
  { title: "Блабла", text: "Модульные строения", img: [] },
  { title: "Блабла", text: "Блок контейнеры", img: [] },
];
